000_РОЗНИЦА_ЦЕНТР/src/Catalogs/ИнформационныеКарты/ИнформационныеКарты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИнформационныеКарты</name>
  <comment>(Упр) Магнитные и штриховые карты.</comment>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Блокирован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДисконтнойКарты</name>
    <type>
      <types>CatalogRef.ВидыДисконтныхКарт</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидКарты</name>
    <type>
      <types>EnumRef.ВидыИнформационныхКарт</types>
    </type>
  </attributes>
  <attributes>
    <name>ВладелецКарты</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗакрытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОткрытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнегоОпроса</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСледующегоОпроса</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>КодКарты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Магазин</name>
    <comment>Магазин, где была проведена выдача карты</comment>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </attributes>
  <attributes>
    <name>Резерв</name>
    <comment>(Служ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипКарты</name>
    <type>
      <types>EnumRef.ТипыИнформационныхКарт</types>
    </type>
  </attributes>
</mdclass:Catalog>

000_РОЗНИЦА_ЦЕНТР/src/Enums/ВидыИнформационныхКарт/ВидыИнформационныхКарт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыИнформационныхКарт</name>
  <comment>(Упр)</comment>
  <enumValues>
    <name>Штриховая</name>
  </enumValues>
  <enumValues>
    <name>Магнитная</name>
  </enumValues>
  <enumValues>
    <name>Смешанная</name>
  </enumValues>
</mdclass:Enum>

000_РОЗНИЦА_ЦЕНТР/src/Catalogs/ИнформационныеКарты/ObjectModule.bsl
///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ВидКарты = Перечисления.ВидыИнформационныхКарт.Штриховая Тогда
		
		МассивНепроверяемыхРеквизитов = Новый Массив;
		МассивНепроверяемыхРеквизитов.Добавить("КодКарты");
		ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
		
	ИначеЕсли ЗначениеЗаполнено(КодКарты) Тогда
		МаркетинговыеАкцииСервер.ПроверитьИспользованиеКодаКарты(
			ЭтотОбъект,
			Отказ
		);
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события "ПриКопировании"
// для объекта
//
Процедура ПриКопировании(ОбъектКопирования)
	
	Если НЕ ЭтоГруппа Тогда

		КодКарты		= "";
		Наименование	= "";
		Резерв			= Ложь;
		Автор			= Неопределено;
		ДатаЗакрытия	= '00010101';
		ДатаОткрытия	= '00010101';
		ДатаСоздания	= ТекущаяДата();
		ДатаПоследнегоОпроса = '00010101';
		ДатаСледующегоОпроса = '00010101';
		Магазин	= Неопределено;

	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события "ПередЗаписью"
//
Процедура ПередЗаписью(Отказ)

	Если НЕ ЭтоГруппа Тогда	//	LNK 13.08.2020 10:34:03

		Если НЕ КодКарты = СокрЛП(КодКарты) Тогда

			КодКарты = СокрЛП(КодКарты);

		КонецЕсли;

	КонецЕсли;

	Если ОбменДанными.Загрузка Тогда

		Возврат;

	КонецЕсли;

	Если НЕ ЭтоГруппа Тогда

		ЗначенияПоСсылке = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, "ПометкаУдаления, Блокирован");

		Если ЗначениеЗаполнено(ВладелецКарты) И Резерв Тогда	//	LNK 16.08.2021 07:22:19

			Резерв = Ложь;	//	"Резерв" может быть только при пустом владельце!

		КонецЕсли;

		Если НЕ (ПометкаУдаления ИЛИ Блокирован) Тогда

			ПроверитьУникальностьКонтактнойИнформации(Отказ);	//	LNK 07.11.2018 07:57:09

		КонецЕсли;

		Если НЕ Отказ Тогда

			Если ВидДисконтнойКарты = Справочники.ВидыДисконтныхКарт.ПредварительныеКартыЛояльности Тогда

				ВладелецКарты = Неопределено;	//	LNK 06.02.2019 07:14:02

			КонецЕсли;

			Если ВидКарты = Перечисления.ВидыИнформационныхКарт.Штриховая Тогда

				КодКарты = "";

			КонецЕсли;

			Если ЭтоНовый() Тогда

				ДатаСоздания = ТекущаяДата();

			ИначеЕсли ДатаСоздания = '00010101' Тогда

				ДатаСоздания = ОбщегоНазначенияКлиентСервер.УникальныйИдентификаторВремя(Ссылка.УникальныйИдентификатор());

			КонецЕсли;

			Если ПометкаУдаления И НЕ ЗначенияПоСсылке.ПометкаУдаления = Истина
			ИЛИ
				 Блокирован И НЕ ЗначенияПоСсылке.Блокирован = Истина
			Тогда

				Блокирован  = Истина;
				ДатаЗакрытия = ТекущаяДата();

			ИначеЕсли НЕ ПометкаУдаления И НЕ Блокирован И НЕ ДатаЗакрытия = '00010101' Тогда

			//	Блокировка карты снята.
				ДатаЗакрытия = '00010101';

			КонецЕсли;

		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

#Область СлужебныеПроцедурыИФункции

//	LNK 07.11.2018 07:57:33
Процедура ПроверитьУникальностьКонтактнойИнформации(Отказ)


КонецПроцедуры
	
#КонецОбласти
